run/primary_breakup/high_density_sphere_advection/2D/incompressible/sphere_advection_basecase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       480;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       496;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       512;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       528;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          512;
        startFace       544;
    }
)

// ************************************************************************* //
