run/primary_breakup/high_density_sphere_advection/2D/incompressible/sphere_advection_basecase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    sphereToCell
    {
        origin	(0.5 0.5 0);
        radius	0.1;
        
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
	    volVectorFieldValue U (1 0 0)
        );
    }
);


// ************************************************************************* //
